chang01234/test1/DICMFramework/sdkconfig/5.x/sdkconfig.defaults.esp32c2
# target
CONFIG_IDF_TARGET_ESP32C2=y
CONFIG_IDF_TARGET="esp32c2"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_120=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=120

# Bluetooth
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY=y

#
# LWIP
#
CONFIG_LWIP_MAX_SOCKETS=6
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=2048


# Nimble
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=20
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_MAX_CONN_REATTEMPT=3
CONFIG_BT_NIMBLE_HS_FLOW_CTRL=y
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=5
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# Wifi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

#
# Security features
#
CONFIG_SECURE_BOOT_SIGNING_KEY="DICMFramework/secure_boot_signing_key_rsa.pem"
# end of Security features


#system 
CONFIG_ESP_DEBUG_OCDAWARE=n

#
# Heap memory debugging
#
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=y

# time
CONFIG_RTC_CLK_SRC_INT_8MD256=y
CONFIG_RTC_CLK_CAL_CYCLES=3000

# FreeRTOS
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1160
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Wireless Coexistence
CONFIG_ESP_COEX_ENABLED=y

# ESP Ringbuf
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y

# ESP Timer (High Resolution Timer)
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048

# TCP
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=4096
CONFIG_LWIP_TCP_WND_DEFAULT=5760

# ESP-Driver:SPI Configurations
CONFIG_SPI_SLAVE_IN_IRAM=n
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n

# Newlib
CONFIG_NEWLIB_NANO_FORMAT=y

# Event Loop Library
CONFIG_ESP_EVENT_POST_FROM_ISR=n
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=n


# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
